In [74]:
# Importing essential libraries
import numpy as np
import pandas as pd
import pickle

In [2]:
#loading the dataset
df = pd.read_csv(r"C:\Users\IT Supports\Desktop\age_of_marriage_data.csv")

In [3]:
#let us look at the top 5 entries of this dataset
df.head()

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0

In [4]:
#how large is this dataset?
df.shape

(2567, 10)

In [76]:
#let us get some stats 
df.describe()

                id  age_of_marriage
count  1932.000000      1932.000000
mean   1280.148033        30.022774
std     741.941627         2.227947
min       2.000000        24.000000
25%     635.750000        28.000000
50%    1285.500000        30.000000
75%    1918.500000        32.000000
max    2567.000000        36.000000

In [6]:
df.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage     19
dtype: int64

In [7]:
df.dropna(inplace=True)

In [8]:
#spliting the datset 
x= df.loc[:, ['gender', 'height', 'religion', 'caste', 'mother_tongue', 'country']]
y= df.age_of_marriage

In [12]:
x.head()

   gender height   religion        caste mother_tongue country
1    male   5'7"       Jain   Shwetamber      Gujarati     USA
2    male   5'7"      Hindu      Brahmin         Hindi   India
3  female   5'0"      Hindu       Thakur         Hindi   India
4    male   5'5"  Christian   Born Again     Malayalam   India
5    male   5'5"      Hindu      Valmiki         Hindi   India

In [11]:
y.head()

1    32.0
2    32.0
3    30.0
4    30.0
5    29.0
Name: age_of_marriage, dtype: float64

In [13]:
from sklearn.preprocessing import LabelEncoder
enc= LabelEncoder()

In [17]:
enc= LabelEncoder()

In [28]:
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()
x.loc[:,['gender','religion','caste','mother_tongue','country']]= \
x.loc[:,['gender','religion','caste','mother_tongue','country']].apply(enc.fit_transform)

In [30]:
#conver height to cm

int(x.loc[1, 'height'].split('\'')[0])*30.48

152.4

In [33]:
int(x.loc[1,'height'].split('\'')[1].replace('\"',''))*2.54

17.78

In [38]:
def h_cms(h):
    
    return int(h.split('\'')[0])*30.48+\
    int(h.split('\'')[1].replace('\"',''))*2.54

In [39]:
x['height_cms']= x.height.apply(h_cms)

In [40]:
x.head()

  gender height religion caste mother_tongue country  height_cms
1      1   5'7"        2    34             6      19      170.18
2      1   5'7"        1    14             8       5      170.18
3      0   5'0"        1    36             8       5      152.40
4      1   5'5"        0    13            13       5      165.10
5      1   5'5"        1    38             8       5      165.10

In [41]:
#drop the hieght columns 
x.drop('height',inplace=True,axis=1 )
x.head()

  gender religion caste mother_tongue country  height_cms
1      1        2    34             6      19      170.18
2      1        1    14             8       5      170.18
3      0        1    36             8       5      152.40
4      1        0    13            13       5      165.10
5      1        1    38             8       5      165.10

In [43]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test= train_test_split(x,y,test_size=0.2,random_state=0)

In [56]:
from sklearn.ensemble import RandomForestRegressor
model= RandomForestRegressor(n_estimators=80, max_depth=11)
model.fit(x_train,y_train)

RandomForestRegressor(max_depth=11, n_estimators=80)

In [57]:
#Model Evaluation
from sklearn.metrics import mean_absolute_error, r2_score
print('MAE:',  mean_absolute_error(y_test, y_predict))
r2_score (y_test, y_predict)

MAE: 1.0452169391045356

0.6764281716144447

In [ ]:
#export model

In [68]:
import joblib as jb
jb.dump(model, 'marriage_age_prediction_model.ml')

['marriage_age_prediction_model.ml']

In [72]:
#now let us predict
model= jb.load('marriage_age_prediction_model.ml')

In [73]:
model.predict([[1,2,5,6,5,175]])

array([29.26134455])